;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

* Generic
** Personal Info
#+begin_src emacs-lisp :tangle yes
(setq user-full-name "Bart Frenk"
      user-mail-address "bart.frenk@gmail.com")
#+end_src

** Core
The command =save-buffer= is bound to =C-x C-s=, while =save-some-buffers= is
bound to =C-x s=. These keybindings are easy to mix up while typing; that is
annoying since the latter command steals focus to the minibuffer while waiting
for a response.

#+begin_src emacs-lisp :tangle yes
(global-unset-key (kbd "C-x s"))
#+end_src

** Appearance
#+begin_src emacs-lisp :tangle yes
(setq doom-theme 'doom-vibrant)
(setq doom-modeline-height 25)
#+end_src

#+begin_src emacs-lisp :tangle yes
(after! doom
  (setq doom-font (font-spec :family "Hack Nerd Font" :size 11)
        display-line-numbers-type t)
  (setq-default line-spacing 4)
  (setq doom-font-increment 1))
#+end_src

#+RESULTS:
: 1

* Global keybindings

#+begin_src emacs-lisp :tangle yes
(map! :leader
      :desc "Jump to next warning"
      "c n" #'flycheck-next-error)
(map! :leader
      :desc "Jump to previous warning"
      "c p" #'flycheck-previous-error)
#+end_src

#+RESULTS:
: flycheck-next-error

* Languages
** Chordpro
#+begin_src emacs-lisp :tangle yes
(add-hook 'chordpro-mode
          (lambda ()
            (visual-fill-column-mode 1)))
#+end_src

** Org
#+begin_src emacs-lisp :tangle yes
(setq org-directory "~/documents/org/"
      org-noter-notes-search-path "~/documents/notes/"
      org-roam-directory "~/documents/roam")
#+end_src

#+RESULTS:
: ~/documents/roam

** Python
#+begin_src emacs-lisp :tangle yes
(after! python
  (set-eglot-client! '(python-mode python-ts-mode)
                     '("pyright-langserver" "--stdio")
                     '("ruff" "server")))

(defun activate-venv ()
  (interactive)
  (if-let ((root-dir (projectile-project-root)))
      (let ((venv-dir (concat (file-name-as-directory root-dir) ".venv")))
        (pyvenv-activate venv-dir)
        (message "Activated virtualenv at %s" venv-dir))
    (message "Could not find virtualenv")))

(after! python
  (use-package! python-black
    :demand t
    :after python)
(add-hook! 'python-mode-hook #'python-black-on-save-mode))
#+end_src

Do not display Python generated files in treemacs
#+begin_src emacs-lisp :tangle yes
(after! treemacs
  (defun treemacs-ignore-pycache (file _)
    (string= file "__pycache__"))
  (push #'treemacs-ignore-pycache treemacs-ignored-file-predicates))
#+end_src

- [ ] Automatically restart eglot when switching virtualenv
- [ ] Automatically reset virtualenv (and restart eglot) when switching project

** Lisp
#+begin_src emacs-lisp :tangle yes
(use-package! paredit
  :defer t
  :commands paredit-mode
  :hook
  (emacs-lisp-mode . paredit-mode))

(use-package! enhanced-evil-paredit
  :defer t
  :commands enhanced-evil-paredit-mode
  :hook
  (paredit-mode . enhanced-evil-paredit-mode))
#+end_src

- [ ] Use paredit instead of parinfer

** Shell Scripts
#+begin_src emacs-lisp :tangle yes
(add-to-list 'auto-mode-alist '("\\.zsh-theme\\'" . bash-ts-mode))
#+end_src
